------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/slm45/Dropbox/backup_Stata/mutz/log/mutz-code-cross-edited-v1.log
  log type:  text
 opened on:  10 May 2018, 12:05:44

. 
. 
. use rawdata/mutz-cross-second-release.dta, clear 

. 
. ********************************************************************************
. *** Original code with
. ***    /* ___ */ inserted to drop unavailable variables 
. ***    a few spaces added before the ///'s 
> ********************************************************************************
. 
.         /*file for running regressions on amerispeaks data */
. 
. egen cutdifftherm= cut(thermdiffTC), group(20)
(292 missing values generated)

. 
. recode majorsex (-4=4)(-3=3)(-2=2) (-1=1)(0=0)(1=-1) ///
>   (2=-2) (3=-3) (4=-4), gen(majorsexR) ///
>   
(2130 differences between majorsex and majorsexR)

. generate majorindex=(majorsexR+majorrelig+majorrace)/3
(66 missing values generated)

.  
.      /*all analysis */
.          /* Table S4 results */
.         
. regress cutdifftherm party3 noncollegegrad  white GENDER AGE7 religion ///
>  INCOME lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf */ ///
>     majorindex pt4r  sdoindex prejudice ///
>      isoindex china immigindex tradeindex natsupindex       ///
>      ecoperc  terrorthreat ///
>         

      Source |       SS           df       MS      Number of obs   =     2,600
-------------+----------------------------------   F(22, 2577)     =    248.43
       Model |  59716.9033        22   2714.4047   Prob > F        =    0.0000
    Residual |  28156.8567     2,577  10.9262153   R-squared       =    0.6796
-------------+----------------------------------   Adj R-squared   =    0.6768
       Total |    87873.76     2,599  33.8106041   Root MSE        =    3.3055

--------------------------------------------------------------------------------
  cutdifftherm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -2.360447   .0941408   -25.07   0.000    -2.545046   -2.175848
noncollegegrad |   .2020169   .1518782     1.33   0.184    -.0957987    .4998325
         white |   1.381371   .1674154     8.25   0.000     1.053089    1.709653
        GENDER |  -.6009819   .1370073    -4.39   0.000    -.8696375   -.3323263
          AGE7 |  -.2143296   .0449224    -4.77   0.000    -.3024172    -.126242
      religion |    .024284   .0259625     0.94   0.350    -.0266254    .0751935
        INCOME |   .0247429   .0173498     1.43   0.154    -.0092781     .058764
      lookwork |   .0780473   .2660952     0.29   0.769    -.4437347    .5998293
      ecoworry |   .1319287   .0973415     1.36   0.175    -.0589467    .3228041
    perecoperc |   -.011901    .077107    -0.15   0.877    -.1630988    .1392969
     safetynet |  -.3685655   .0809647    -4.55   0.000    -.5273279    -.209803
    majorindex |   .5318991   .0706066     7.53   0.000     .3934476    .6703505
          pt4r |   .2435598   .0945411     2.58   0.010     .0581755     .428944
      sdoindex |     .09715   .0452396     2.15   0.032     .0084402    .1858597
     prejudice |   .1165824   .0628003     1.86   0.064    -.0065617    .2397265
      isoindex |   .3874901   .0875472     4.43   0.000     .2158201    .5591601
         china |   .1970608    .117303     1.68   0.093    -.0329569    .4270785
    immigindex |  -.8193969    .082029    -9.99   0.000    -.9802463   -.6585475
    tradeindex |  -.3629212   .0688125    -5.27   0.000    -.4978545   -.2279879
   natsupindex |  -.1273462    .081663    -1.56   0.119     -.287478    .0327857
       ecoperc |  -.8826305   .0754096   -11.70   0.000      -1.0305   -.7347609
  terrorthreat |  -.1528237   .0988914    -1.55   0.122    -.3467384     .041091
         _cons |   21.20048   .8910086    23.79   0.000     19.45331    22.94765
--------------------------------------------------------------------------------

. logit voterclintrump party3 noncollegegrad  white GENDER AGE7 religion ///
>  INCOME lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf */ majorindex pt4r sdoindex prejudice ///
>      isoindex china immigindex tradeindex natsupindex       ///
>     /* syslegindex govttrust */ ecoperc  terrorthreat ///
>   

Iteration 0:   log likelihood = -1452.6085  
Iteration 1:   log likelihood = -396.81939  
Iteration 2:   log likelihood = -330.61525  
Iteration 3:   log likelihood = -321.67478  
Iteration 4:   log likelihood = -321.63947  
Iteration 5:   log likelihood = -321.63947  

Logistic regression                             Number of obs     =      2,175
                                                LR chi2(22)       =    2261.94
                                                Prob > chi2       =     0.0000
Log likelihood = -321.63947                     Pseudo R2         =     0.7786

--------------------------------------------------------------------------------
voterclintrump |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.786905   .1276923   -13.99   0.000    -2.037177   -1.536633
noncollegegrad |   .0771293   .2537639     0.30   0.761    -.4202389    .5744974
         white |   1.364163   .2726573     5.00   0.000      .829764    1.898561
        GENDER |  -.5238861   .2265584    -2.31   0.021    -.9679324   -.0798398
          AGE7 |  -.1385785   .0733508    -1.89   0.059    -.2823434    .0051865
      religion |   .0650567   .0422889     1.54   0.124    -.0178279    .1479414
        INCOME |   .0303333   .0269721     1.12   0.261     -.022531    .0831977
      lookwork |  -.1618752   .4458972    -0.36   0.717    -1.035818    .7120673
      ecoworry |   .0837335   .1588422     0.53   0.598    -.2275914    .3950584
    perecoperc |   .1309442   .1289398     1.02   0.310    -.1217731    .3836615
     safetynet |  -.3918238   .1334401    -2.94   0.003    -.6533616    -.130286
    majorindex |   .5442778   .1199223     4.54   0.000     .3092343    .7793213
          pt4r |   .4247483   .1677662     2.53   0.011     .0959326     .753564
      sdoindex |   .1364121   .0723624     1.89   0.059    -.0054157    .2782399
     prejudice |   .1445676   .0977433     1.48   0.139    -.0470058    .3361409
      isoindex |   .3560573   .1463518     2.43   0.015     .0692131    .6429015
         china |   .3359077    .183875     1.83   0.068    -.0244808    .6962962
    immigindex |  -1.067213   .1263287    -8.45   0.000    -1.314812   -.8196129
    tradeindex |  -.3501627   .1087804    -3.22   0.001    -.5633684    -.136957
   natsupindex |    .117375   .1367768     0.86   0.391    -.1507026    .3854527
       ecoperc |  -.7580073   .1162154    -6.52   0.000    -.9857853   -.5302293
  terrorthreat |  -.0986632   .1629796    -0.61   0.545    -.4180973     .220771
         _cons |   6.830333   1.438848     4.75   0.000     4.010244    9.650423
--------------------------------------------------------------------------------

. 
. logit trumppref party3 noncollegegrad  white GENDER AGE7 religion ///
>  INCOME lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf  */ majorindex pt4r sdoindex prejudice ///
>      isoindex china immigindex tradeindex natsupindex       ///
>     /* syslegindex govttrust */ ecoperc  terrorthreat ///
> 

Iteration 0:   log likelihood = -1760.5805  
Iteration 1:   log likelihood = -888.41035  
Iteration 2:   log likelihood = -787.06758  
Iteration 3:   log likelihood = -778.52929  
Iteration 4:   log likelihood = -778.48045  
Iteration 5:   log likelihood = -778.48044  

Logistic regression                             Number of obs     =      2,845
                                                LR chi2(22)       =    1964.20
                                                Prob > chi2       =     0.0000
Log likelihood = -778.48044                     Pseudo R2         =     0.5578

--------------------------------------------------------------------------------
     trumppref |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.108835   .0781816   -14.18   0.000    -1.262068   -.9556018
noncollegegrad |   .0956611   .1556332     0.61   0.539    -.2093744    .4006966
         white |   .6523508   .1855502     3.52   0.000      .288679    1.016023
        GENDER |  -.0411411   .1391679    -0.30   0.768    -.3139052     .231623
          AGE7 |   .0218784   .0456755     0.48   0.632    -.0676438    .1114007
      religion |   .0317464   .0252373     1.26   0.208    -.0177179    .0812106
        INCOME |    .047212    .017265     2.73   0.006     .0133732    .0810509
      lookwork |   .1271459   .2883235     0.44   0.659    -.4379578    .6922496
      ecoworry |  -.0325884   .1004648    -0.32   0.746    -.2294958     .164319
    perecoperc |   .0412109   .0766237     0.54   0.591    -.1089689    .1913906
     safetynet |  -.1747368   .0815345    -2.14   0.032    -.3345415    -.014932
    majorindex |   .3444324   .0740563     4.65   0.000     .1992847    .4895801
          pt4r |   .2678034     .10751     2.49   0.013     .0570877    .4785191
      sdoindex |   .0694869   .0444039     1.56   0.118    -.0175431     .156517
     prejudice |   .1188706   .0627781     1.89   0.058    -.0041722    .2419134
      isoindex |  -.0951711   .0865617    -1.10   0.272    -.2648288    .0744867
         china |   .0823479   .1156343     0.71   0.476    -.1442912     .308987
    immigindex |  -.8078268   .0806265   -10.02   0.000    -.9658517   -.6498018
    tradeindex |  -.1841493   .0678518    -2.71   0.007    -.3171363   -.0511622
   natsupindex |   .1933302   .0841861     2.30   0.022     .0283285    .3583319
       ecoperc |  -.3774516   .0698007    -5.41   0.000    -.5142584   -.2406448
  terrorthreat |   .2009552    .107283     1.87   0.061    -.0093157    .4112261
         _cons |   2.276848   .9011219     2.53   0.012     .5106811    4.043014
--------------------------------------------------------------------------------

.   
.      /* analysis demonstrating what education represents*/
.         /* Figure 3 and Table S5 results */
.         
. regress cutdifftherm party3 noncollegegrad  white GENDER AGE7 religion INCOME

      Source |       SS           df       MS      Number of obs   =     2,912
-------------+----------------------------------   F(7, 2904)      =    438.88
       Model |  49739.3066         7  7105.61523   Prob > F        =    0.0000
    Residual |  47016.4018     2,904   16.190221   R-squared       =    0.5141
-------------+----------------------------------   Adj R-squared   =    0.5129
       Total |  96755.7084     2,911  33.2379624   Root MSE        =    4.0237

--------------------------------------------------------------------------------
  cutdifftherm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -4.115251    .085765   -47.98   0.000    -4.283418   -3.947085
noncollegegrad |   1.354821   .1651205     8.21   0.000     1.031056    1.678586
         white |   1.222642   .1729898     7.07   0.000     .8834467    1.561837
        GENDER |  -.7338294    .153083    -4.79   0.000    -1.033992    -.433667
          AGE7 |  -.2113732    .045629    -4.63   0.000    -.3008417   -.1219047
      religion |   .0757604   .0288915     2.62   0.009     .0191105    .1324103
        INCOME |   .0009852   .0192622     0.05   0.959    -.0367837     .038754
         _cons |   18.80391   .4772161    39.40   0.000     17.86819    19.73963
--------------------------------------------------------------------------------

. 
. regress cutdifftherm party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>  lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf */

      Source |       SS           df       MS      Number of obs   =     2,895
-------------+----------------------------------   F(11, 2883)     =    340.67
       Model |  54373.6132        11  4943.05574   Prob > F        =    0.0000
    Residual |  41831.7326     2,883  14.5097928   R-squared       =    0.5652
-------------+----------------------------------   Adj R-squared   =    0.5635
       Total |  96205.3458     2,894  33.2430359   Root MSE        =    3.8092

--------------------------------------------------------------------------------
  cutdifftherm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -3.396123   .0922729   -36.81   0.000    -3.577051   -3.215196
noncollegegrad |   1.063025   .1587493     6.70   0.000     .7517514    1.374298
         white |   1.157564   .1651471     7.01   0.000     .8337454    1.481382
        GENDER |  -.7471787   .1465738    -5.10   0.000    -1.034579   -.4597786
          AGE7 |  -.1591392   .0456619    -3.49   0.000    -.2486725   -.0696059
      religion |   .0691267   .0275245     2.51   0.012      .015157    .1230964
        INCOME |   .0004484   .0186207     0.02   0.981    -.0360629    .0369596
      lookwork |   .0556202   .2872282     0.19   0.846    -.5075732    .6188136
      ecoworry |   .4062913   .0975926     4.16   0.000     .2149331    .5976496
    perecoperc |  -.7686675   .0751608   -10.23   0.000    -.9160419   -.6212931
     safetynet |  -1.052448   .0827325   -12.72   0.000    -1.214669   -.8902271
         _cons |   21.86425    .649189    33.68   0.000     20.59133    23.13718
--------------------------------------------------------------------------------

.   
. regress cutdifftherm party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>     majorindex pt4r  sdoindex prejudice ///
>      isoindex china immigindex tradeindex     

      Source |       SS           df       MS      Number of obs   =     2,616
-------------+----------------------------------   F(15, 2600)     =    328.36
       Model |  57858.6931        15  3857.24621   Prob > F        =    0.0000
    Residual |   30542.331     2,600  11.7470504   R-squared       =    0.6545
-------------+----------------------------------   Adj R-squared   =    0.6525
       Total |  88401.0241     2,615  33.8053629   Root MSE        =    3.4274

--------------------------------------------------------------------------------
  cutdifftherm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -2.616572   .0930716   -28.11   0.000    -2.799074    -2.43407
noncollegegrad |   .1678047   .1556618     1.08   0.281    -.1374289    .4730383
         white |   1.507007   .1715777     8.78   0.000     1.170564     1.84345
        GENDER |  -.5132621   .1390432    -3.69   0.000    -.7859087   -.2406154
          AGE7 |  -.2725512   .0417597    -6.53   0.000    -.3544369   -.1906654
      religion |   .0236928   .0266479     0.89   0.374    -.0285603     .075946
        INCOME |   .0236566   .0176341     1.34   0.180    -.0109217    .0582348
    majorindex |   .6890798   .0708797     9.72   0.000     .5500933    .8280662
          pt4r |   .3839795   .0845871     4.54   0.000     .2181145    .5498445
      sdoindex |   .1256933   .0461217     2.73   0.006     .0352544    .2161322
     prejudice |   .1116178    .064461     1.73   0.083    -.0147823    .2380178
      isoindex |   .5165961   .0894319     5.78   0.000     .3412311    .6919611
         china |    .236447   .1206471     1.96   0.050    -.0001271     .473021
    immigindex |  -.9501983   .0812565   -11.69   0.000    -1.109532   -.7908643
    tradeindex |  -.5121839   .0695489    -7.36   0.000    -.6485608   -.3758071
         _cons |   17.35069   .7581859    22.88   0.000     15.86398     18.8374
--------------------------------------------------------------------------------

. 
. 
. logit voterclintrump party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
> 

Iteration 0:   log likelihood = -1610.5322  
Iteration 1:   log likelihood =  -701.7155  
Iteration 2:   log likelihood =  -680.8126  
Iteration 3:   log likelihood = -680.11478  
Iteration 4:   log likelihood = -680.11382  
Iteration 5:   log likelihood = -680.11382  

Logistic regression                             Number of obs     =      2,429
                                                LR chi2(7)        =    1860.84
                                                Prob > chi2       =     0.0000
Log likelihood = -680.11382                     Pseudo R2         =     0.5777

--------------------------------------------------------------------------------
voterclintrump |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -2.337677   .0825088   -28.33   0.000    -2.499391   -2.175963
noncollegegrad |   1.072095   .1643681     6.52   0.000     .7499399    1.394251
         white |   1.235288   .1725186     7.16   0.000     .8971581    1.573419
        GENDER |  -.4125429   .1473869    -2.80   0.005    -.7014159   -.1236699
          AGE7 |  -.0122758    .045119    -0.27   0.786    -.1007074    .0761558
      religion |   .0666103   .0278681     2.39   0.017     .0119899    .1212307
        INCOME |   .0270425     .01846     1.46   0.143    -.0091384    .0632234
         _cons |   3.159059   .4411039     7.16   0.000     2.294512    4.023607
--------------------------------------------------------------------------------

. logit voterclintrump party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>   lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf */ ///
>   

Iteration 0:   log likelihood = -1600.4637  
Iteration 1:   log likelihood = -637.07876  
Iteration 2:   log likelihood = -591.25716  
Iteration 3:   log likelihood = -588.50279  
Iteration 4:   log likelihood = -588.49299  
Iteration 5:   log likelihood = -588.49299  

Logistic regression                             Number of obs     =      2,412
                                                LR chi2(11)       =    2023.94
                                                Prob > chi2       =     0.0000
Log likelihood = -588.49299                     Pseudo R2         =     0.6323

--------------------------------------------------------------------------------
voterclintrump |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -2.033073   .0885236   -22.97   0.000    -2.206577    -1.85957
noncollegegrad |   1.015436      .1809     5.61   0.000     .6608784    1.369993
         white |   1.254363   .1819887     6.89   0.000     .8976719    1.611054
        GENDER |  -.4691892    .159491    -2.94   0.003    -.7817857   -.1565926
          AGE7 |   .0184609   .0506775     0.36   0.716    -.0808652     .117787
      religion |   .0754661   .0301646     2.50   0.012     .0163446    .1345875
        INCOME |   .0219738   .0201451     1.09   0.275    -.0175098    .0614575
      lookwork |  -.0380461    .336358    -0.11   0.910    -.6972956    .6212034
      ecoworry |   .3750826   .1092588     3.43   0.001     .1609392     .589226
    perecoperc |  -.5546016   .0838758    -6.61   0.000    -.7189952   -.3902081
     safetynet |  -.8728471   .0962609    -9.07   0.000    -1.061515   -.6841792
         _cons |   5.833653   .7388301     7.90   0.000     4.385573    7.281734
--------------------------------------------------------------------------------

. logit voterclintrump party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>     majorindex pt4r  sdoindex prejudice ///
>      isoindex china immigindex tradeindex      

Iteration 0:   log likelihood = -1464.1806  
Iteration 1:   log likelihood = -427.90623  
Iteration 2:   log likelihood = -364.73332  
Iteration 3:   log likelihood = -356.51667  
Iteration 4:   log likelihood =  -356.4904  
Iteration 5:   log likelihood =  -356.4904  

Logistic regression                             Number of obs     =      2,193
                                                LR chi2(15)       =    2215.38
                                                Prob > chi2       =     0.0000
Log likelihood =  -356.4904                     Pseudo R2         =     0.7565

--------------------------------------------------------------------------------
voterclintrump |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.933638    .116891   -16.54   0.000     -2.16274   -1.704535
noncollegegrad |   .1293064   .2366986     0.55   0.585    -.3346144    .5932272
         white |   1.353907   .2511777     5.39   0.000     .8616078    1.846206
        GENDER |  -.3570673   .2082362    -1.71   0.086    -.7652027    .0510681
          AGE7 |  -.1307481   .0645924    -2.02   0.043    -.2573468   -.0041494
      religion |   .0566064    .039186     1.44   0.149    -.0201969    .1334096
        INCOME |   .0459222   .0250374     1.83   0.067    -.0031503    .0949947
    majorindex |   .6203324   .1120157     5.54   0.000     .4007857     .839879
          pt4r |   .5627086   .1343011     4.19   0.000     .2994832    .8259339
      sdoindex |   .1604065    .068425     2.34   0.019      .026296    .2945171
     prejudice |    .207346    .092258     2.25   0.025     .0265235    .3881684
      isoindex |   .4320733   .1351831     3.20   0.001     .1671194    .6970273
         china |   .3920579   .1734919     2.26   0.024       .05202    .7320959
    immigindex |  -1.125509   .1164922    -9.66   0.000     -1.35383   -.8971884
    tradeindex |  -.4273897   .0994027    -4.30   0.000    -.6222154   -.2325641
         _cons |   3.453766   1.106394     3.12   0.002     1.285274    5.622258
--------------------------------------------------------------------------------

. 
. logit trumppref party3 noncollegegrad  white GENDER AGE7 religion INCOME

Iteration 0:   log likelihood = -1957.5295  
Iteration 1:   log likelihood =  -1241.822  
Iteration 2:   log likelihood = -1191.2281  
Iteration 3:   log likelihood = -1189.9033  
Iteration 4:   log likelihood = -1189.9021  
Iteration 5:   log likelihood = -1189.9021  

Logistic regression                             Number of obs     =      3,203
                                                LR chi2(7)        =    1535.25
                                                Prob > chi2       =     0.0000
Log likelihood = -1189.9021                     Pseudo R2         =     0.3921

--------------------------------------------------------------------------------
     trumppref |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.692345   .0593723   -28.50   0.000    -1.808712   -1.575977
noncollegegrad |   .6361357   .1166985     5.45   0.000     .4074107    .8648606
         white |    .668209   .1282501     5.21   0.000     .4168435    .9195746
        GENDER |  -.2198253   .1068351    -2.06   0.040    -.4292183   -.0104323
          AGE7 |   .1389414   .0319963     4.34   0.000     .0762297    .2016531
      religion |   .0492146   .0194778     2.53   0.012     .0110387    .0873904
        INCOME |   .0395618   .0134129     2.95   0.003      .013273    .0658506
         _cons |   .8157324   .3158957     2.58   0.010     .1965883    1.434877
--------------------------------------------------------------------------------

. 
. logit trumppref party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>  lookwork ecoworry perecoperc  safetynet /* medianincome ///
>    prop_civlaborforce_unemp prop_manuf */

Iteration 0:   log likelihood = -1944.4907  
Iteration 1:   log likelihood =   -1175.46  
Iteration 2:   log likelihood = -1111.4758  
Iteration 3:   log likelihood = -1109.5103  
Iteration 4:   log likelihood = -1109.5033  
Iteration 5:   log likelihood = -1109.5033  

Logistic regression                             Number of obs     =      3,176
                                                LR chi2(11)       =    1669.97
                                                Prob > chi2       =     0.0000
Log likelihood = -1109.5033                     Pseudo R2         =     0.4294

--------------------------------------------------------------------------------
     trumppref |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.478812   .0637643   -23.19   0.000    -1.603788   -1.353836
noncollegegrad |   .5970871   .1239804     4.82   0.000     .3540901    .8400842
         white |   .6349118   .1337998     4.75   0.000      .372669    .8971546
        GENDER |  -.1960139   .1122912    -1.75   0.081    -.4161007    .0240729
          AGE7 |   .1738748   .0351767     4.94   0.000     .1049298    .2428198
      religion |   .0456563    .020334     2.25   0.025     .0058024    .0855103
        INCOME |   .0380904   .0142676     2.67   0.008     .0101265    .0660544
      lookwork |   .1145974   .2360746     0.49   0.627    -.3481004    .5772951
      ecoworry |   .3217555   .0765824     4.20   0.000     .1716568    .4718541
    perecoperc |  -.3497343   .0577405    -6.06   0.000    -.4629035   -.2365651
     safetynet |  -.5074516    .063803    -7.95   0.000    -.6325032   -.3823999
         _cons |   1.929112   .4866441     3.96   0.000     .9753074    2.882917
--------------------------------------------------------------------------------

.   
. logit trumppref party3 noncollegegrad  white GENDER AGE7 religion INCOME ///
>     majorindex pt4r  sdoindex prejudice ///
>      isoindex china immigindex tradeindex      

Iteration 0:   log likelihood = -1773.9129  
Iteration 1:   log likelihood = -916.24923  
Iteration 2:   log likelihood = -815.82753  
Iteration 3:   log likelihood =  -808.1862  
Iteration 4:   log likelihood = -808.16146  
Iteration 5:   log likelihood = -808.16146  

Logistic regression                             Number of obs     =      2,868
                                                LR chi2(15)       =    1931.50
                                                Prob > chi2       =     0.0000
Log likelihood = -808.16146                     Pseudo R2         =     0.5444

--------------------------------------------------------------------------------
     trumppref |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.197087   .0743235   -16.11   0.000    -1.342758   -1.051416
noncollegegrad |   .0762246   .1491783     0.51   0.609    -.2161595    .3686086
         white |   .6015072   .1778041     3.38   0.001     .2530176    .9499968
        GENDER |  -.0423271   .1326247    -0.32   0.750    -.3022666    .2176125
          AGE7 |   .0628526   .0405148     1.55   0.121     -.016555    .1422601
      religion |   .0410073   .0245199     1.67   0.094    -.0070507    .0890654
        INCOME |   .0495808   .0164783     3.01   0.003     .0172839    .0818776
    majorindex |   .4072447   .0714893     5.70   0.000     .2671283    .5473611
          pt4r |    .437159   .0900681     4.85   0.000     .2606287    .6136893
      sdoindex |   .0946752   .0430134     2.20   0.028     .0103705      .17898
     prejudice |    .152541   .0616393     2.47   0.013     .0317301    .2733518
      isoindex |  -.0688861   .0839391    -0.82   0.412    -.2334038    .0956315
         china |   .0972116   .1119656     0.87   0.385    -.1222369    .3166601
    immigindex |  -.9034549   .0773153   -11.69   0.000     -1.05499   -.7519197
    tradeindex |  -.2213897   .0648096    -3.42   0.001    -.3484142   -.0943651
         _cons |   1.729219   .7251373     2.38   0.017     .3079759    3.150462
--------------------------------------------------------------------------------

.  
.   /* models with only economic hardship vars */
.   /* Table S3 results */  
. regress cutdifftherm party3 AGE7 GENDER noncollegegrad religion white ///
>  INCOME lookwork ecoworry perecoperc safetynet ecoperc /* prop_manuf medianincome ///
>   prop_civlaborforce_unemp */

      Source |       SS           df       MS      Number of obs   =     2,886
-------------+----------------------------------   F(12, 2873)     =    377.54
       Model |  58715.0387        12  4892.91989   Prob > F        =    0.0000
    Residual |  37234.4267     2,873  12.9601207   R-squared       =    0.6119
-------------+----------------------------------   Adj R-squared   =    0.6103
       Total |  95949.4653     2,885  33.2580469   Root MSE        =       3.6

--------------------------------------------------------------------------------
  cutdifftherm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -2.973437   .0903891   -32.90   0.000    -3.150671   -2.796203
          AGE7 |  -.1707909   .0433172    -3.94   0.000     -.255727   -.0858549
        GENDER |  -.8607463   .1388673    -6.20   0.000    -1.133036   -.5884567
noncollegegrad |   .8141029   .1508808     5.40   0.000     .5182573    1.109949
      religion |   .0463182   .0260775     1.78   0.076    -.0048143    .0974508
         white |   1.126517   .1564865     7.20   0.000       .81968    1.433354
        INCOME |   .0185422   .0176536     1.05   0.294    -.0160727    .0531571
      lookwork |   .0307454   .2715384     0.11   0.910    -.5016843    .5631751
      ecoworry |   .3098717    .092743     3.34   0.001     .1280222    .4917212
    perecoperc |  -.1462992   .0786378    -1.86   0.063    -.3004914    .0078931
     safetynet |  -.8119613   .0792536   -10.25   0.000     -.967361   -.6565616
       ecoperc |  -1.364821   .0733959   -18.60   0.000    -1.508735   -1.220907
         _cons |   23.01309   .6178773    37.25   0.000     21.80156    24.22461
--------------------------------------------------------------------------------

. 
. logit voterclintrump party3 AGE7 GENDER noncollegegrad religion white ///
>  INCOME lookwork ecoworry perecoperc safetynet ecoperc /* prop_manuf medianincome ///
>   prop_civlaborforce_unemp */

Iteration 0:   log likelihood = -1596.5988  
Iteration 1:   log likelihood = -567.33001  
Iteration 2:   log likelihood = -518.87756  
Iteration 3:   log likelihood = -511.43553  
Iteration 4:   log likelihood = -511.41103  
Iteration 5:   log likelihood = -511.41103  

Logistic regression                             Number of obs     =      2,407
                                                LR chi2(12)       =    2170.38
                                                Prob > chi2       =     0.0000
Log likelihood = -511.41103                     Pseudo R2         =     0.6797

--------------------------------------------------------------------------------
voterclintrump |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |  -1.915156   .0951824   -20.12   0.000    -2.101711   -1.728602
          AGE7 |   .0060364   .0543802     0.11   0.912    -.1005469    .1126197
        GENDER |  -.6282491   .1740377    -3.61   0.000    -.9693566   -.2871415
noncollegegrad |   .8462166   .1911927     4.43   0.000     .4714858    1.220947
      religion |   .0677788    .032617     2.08   0.038     .0038507    .1317069
         white |   1.352975   .1957681     6.91   0.000     .9692767    1.736674
        INCOME |    .026739   .0213156     1.25   0.210    -.0150388    .0685168
      lookwork |   .0108589   .3518169     0.03   0.975    -.6786895    .7004074
      ecoworry |   .3024368   .1185171     2.55   0.011     .0701475     .534726
    perecoperc |  -.0559744   .0991407    -0.56   0.572    -.2502867    .1383379
     safetynet |  -.7631334   .1028514    -7.42   0.000    -.9647185   -.5615483
       ecoperc |  -1.044492   .0915591   -11.41   0.000    -1.223944   -.8650392
         _cons |   7.389226   .8129349     9.09   0.000     5.795903    8.982549
--------------------------------------------------------------------------------

. 
. logit trumppref party3 AGE7 GENDER noncollegegrad religion white ///
>  INCOME lookwork ecoworry perecoperc safetynet ecoperc /* prop_manuf medianincome ///
>   prop_civlaborforce_unemp */

Iteration 0:   log likelihood =  -1938.741  
Iteration 1:   log likelihood = -1117.5196  
Iteration 2:   log likelihood = -1041.3154  
Iteration 3:   log likelihood = -1038.9494  
Iteration 4:   log likelihood = -1038.9467  
Iteration 5:   log likelihood = -1038.9467  

Logistic regression                             Number of obs     =      3,167
                                                LR chi2(12)       =    1799.59
                                                Prob > chi2       =     0.0000
Log likelihood = -1038.9467                     Pseudo R2         =     0.4641

--------------------------------------------------------------------------------
     trumppref |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
        party3 |   -1.38053   .0662909   -20.83   0.000    -1.510458   -1.250602
          AGE7 |   .1645761   .0363258     4.53   0.000     .0933789    .2357733
        GENDER |  -.2485473   .1166771    -2.13   0.033    -.4772303   -.0198644
noncollegegrad |   .4846958   .1290376     3.76   0.000     .2317868    .7376049
      religion |   .0372946   .0210314     1.77   0.076    -.0039261    .0785154
         white |   .6962052   .1394562     4.99   0.000     .4228761    .9695344
        INCOME |   .0453938   .0147297     3.08   0.002      .016524    .0742635
      lookwork |   .1653831     .23992     0.69   0.491    -.3048515    .6356177
      ecoworry |   .2829512   .0796853     3.55   0.000     .1267708    .4391315
    perecoperc |  -.0452406   .0654929    -0.69   0.490    -.1736044    .0831232
     safetynet |  -.4149435   .0663872    -6.25   0.000    -.5450601    -.284827
       ecoperc |  -.6615912   .0587165   -11.27   0.000    -.7766734   -.5465089
         _cons |     2.6304   .5085233     5.17   0.000     1.633713    3.627087
--------------------------------------------------------------------------------

.   
. log close
      name:  <unnamed>
       log:  /Users/slm45/Dropbox/backup_Stata/mutz/log/mutz-code-cross-edited-v1.log
  log type:  text
 closed on:  10 May 2018, 12:05:46
------------------------------------------------------------------------------------------------------------------------
